mspinksosu/C-Libraries/I2C/I2C1_PIC32.c
/***************************************************************************//**
 * @brief Basic I2C Peripheral for PIC32
 * 
 * @file I2C1_PIC32.c
 * 
 * @author Matthew Spinks <https://github.com/mspinksosu>
 * 
 * @date 10/2/16   Original Creation (PIC32)
 * @date 2/21/22   Added Doxygen
 * 
 * @details
 *      @todo documentation
 * 
 * @section license License
 * SPDX-FileCopyrightText: © 2016 Matthew Spinks
 * SPDX-License-Identifier: Zlib
 * 
 * This software is released under the Zlib license. You are free alter and
 * redistribute it, but you must not misrepresent the origin of the software.
 * This notice may not be removed. <http://www.zlib.net/zlib_license.html>
 * 
*******************************************************************************/

#include "I2C1.h"
#include "app.h"
#include <math.h> // only needed if we want to compute baud rate
#include <xc.h>

// ***** Defines ***************************************************************

// default values defined by the user
#define PBCLK_FREQ          40000000UL // in Hz
#define TIMEOUT_PERIOD_US   500 // desired timeout period in us
#define RETRY_COUNT 5 // how many times to retry a command before failing

/* C macros for computing period value for timeout. The source clock frequency
 * is basically how often you will call the function to update the state 
 * machine. You can set it to any value you want in Hz. If you update the FSM 
 * once per loop, just leave it the same as the source clock. The timeout value 
 * in us does not have to be very precise. It is just a rough number used for 
 * the FSM to determine if something went wrong. I have it set to 1 millisecond 
 * by default.
 */
#define TIMOUT_SRC_CLK_FREQ     PBCLK_FREQ // in Hz
#define TIMEOUT_SRC_CLK_US      (1.0 / TIMOUT_SRC_CLK_FREQ * 1000000.0)
#define TIMEOUT_PERIOD_COUNT    (TIMEOUT_PERIOD_US / TIMEOUT_SRC_CLK_US)

#define DEFAULT_BRG_VALUE       0x2C

/* Registers */
#define I2CxCON I2C1CON           // I2C control
#define I2CxCONbits I2C1CONbits   // I2C control bits
#define I2CxSTAT I2C1STAT         // I2C status
#define I2CxSTATbits I2C1STATbits // I2C status bits
#define I2CxBRG I2C1BRG           // baud rate generator
#define I2CxRCV I2C1RCV           // receive register
#define I2CxTRN I2C1TRN           // transmit register
// interrupt status register

// ***** Global Variables ******************************************************

// ----- @label new interface code ---------------------------------------------

/* Assign functions to the interface */
I2CInterface I2C1_FunctionTable = {
    .I2C_ComputeBRGValue = I2C1_ComputeBRGValue,
    .I2C_Init = I2C1_Init,
    .I2C_ReceivedDataEvent = I2C1_ReceivedDataEvent,
    .I2C_GetReceivedByte = I2C1_GetReceivedByte,
    .I2C_IsReceiveRegisterFull = I2C1_IsReceiveRegisterFull,
    .I2C_IsReceiveUsingInterrupts = I2C1_IsReceiveUsingInterrupts,
    .I2C_ReceiveEnable = I2C1_ReceiveEnable,
    .I2C_ReceiveDisable = I2C1_ReceiveDisable,
    .I2C_TransmitRegisterEmptyEvent = I2C1_TransmitRegisterEmptyEvent,
    .I2C_TransmitByte = I2C1_TransmitByte,
    .I2C_IsTransmitRegisterEmpty = I2C1_IsTransmitRegisterEmpty,
    .I2C_IsTransmitFinished = I2C1_IsTransmitFinished,
    .I2C_IsTransmitUsingInterrupts = I2C1_IsTransmitUsingInterrupts,
    .I2C_TransmitEnable = I2C1_TransmitEnable,
    .I2C_TransmitDisable = I2C1_TransmitDisable,
    .I2C_PendingEventHandler = I2C1_PendingEventHandler,
    .I2C_SetTransmitRegisterEmptyCallback = I2C1_SetTransmitRegisterEmptyCallback,
    .I2C_SetReceivedDataCallback = I2C1_SetReceivedDataCallback,
    .I2C_IsBusy = I2C1_IsBusy,
    .I2C_Start = I2C1_Start,
    .I2C_Stop = I2C1_Stop,
    .I2C_Restart = I2C1_Restart,
    .I2C_SendAck = I2C1_SendAck,
    .I2C_GetStartStatus = I2C1_GetStartStatus,
    .I2C_GetStopStatus = I2C1_GetStopStatus,
    .I2C_GetRestartStatus = I2C1_GetRestartStatus,
    .I2C_GetAckStatus = I2C1_GetAckStatus,
};

// -----------------------------------------------------------------------------

// Free timer (with bit field)
typedef struct
{
    uint16_t period;
    uint16_t count;
    uint8_t retryCount;
    
    // bit field
    union {
        struct {
            unsigned start          :1;
            unsigned active         :1;
            unsigned expired        :1;
            unsigned retryFinished  :1;
            unsigned                :0; // fill to nearest byte
        };
    } flags;
} FsmTimer;

/* A lot of the enable bits are cleared automatically and they are cleared
 too quickly for me to catch just by reading the register. These status bits
 will assist us by telling us what the state machine is currently trying to do. 
 They will get set anytime a function like start, stop, or restart is called. 
 Then we can check these values against the current status of the I2C registers 
 to see if that action has finished */
typedef struct
{
    union {
        struct {
            unsigned sendingStart   :1;
            unsigned sendingRestart :1;
            unsigned sendingStop    :1;
            unsigned sendingAck     :1;
            unsigned receiveInProgress  :1;
            unsigned transmitInProgress :1;
            unsigned :2;
        };
        struct {
            unsigned all :8;
        };
    };
} StatusBits;

typedef uint8_t Signal;
typedef struct Fsm Fsm;
typedef struct Event Event;

// This is the function pointer type for the state machine functions
typedef void (*State)(Event *e);

enum Signal
{
    BEGIN_TRANSFER = 1,
    BUS_IDLE_EVENT,
    ACK_RECEIVED,
    DATA_RECEIVED,
    TIMEOUT,
};

struct Fsm
{
    State state;
    StatusBits statusBits;
};

struct Event
{
    /** Tells the state what kind of event just happened. Uses the enumerated 
     * type called Signal*/
    Signal sig;
    
//    /** If there is a received packet, place it in here and pass it to the 
//     * state machine*/
//    uint8_t readBuffer[RX_BUF_SIZE];

    struct
    {
        uint8_t slaveAddress;
        bool generateRepeatedStart; // at the end of transfer
        bool repeatedStart;         // repeated start has been performed
        bool masterRead;            // go into read state after sending address
        
