mspinksosu/C-Libraries/I2C/I2C1_PIC32.c
        /* TODO Decide if data should be copied into an array and given to the 
         * state machine or if we want to pass by reference. Copying data may 
         * be the safest route, because if the something goes wrong in the FSM
         * and the user doesn't wait and check it, then the data could change */
        //uint8_t writeBuffer[TX_BUF_SIZE];
        //uint8_t writeSize;
    } private;
};

static FsmTimer I2C1_FsmTimer, I2C1_WaitTimer;
static Fsm I2C1_Fsm;
static Event I2C1_Event;
static bool isBusBusy, prevBusBusy, currentAckStat, prevAckStat;

// local function pointers
void (*I2C1_TransmitFinishedCallback)(void);
void (*I2C1_ReceiveInterruptCallback)(void);

// @todo decide if I want to use a separate static I2C object or just use 
// the I2C slave object
static I2CObject I2C1_I2CObject;
static I2CObject *ptrI2CSlave;

// states
static void I2C1_FsmIdle(Event *e);
static void I2C1_FsmStart(Event *e);
static void I2C1_FsmWriteAddress(Event *e);
static void I2C1_FsmWriteData(Event *e);
static void I2C1_FsmStop(Event *e);
static void I2C1_FsmRestart(Event *e);
static void I2C1_FsmReadData(Event *e);

// ***** Static Function Prototypes ********************************************

static void I2C1_TimerStart(void);
static void I2C1_TimerStop(void);
//static bool I2C1_IsBusIdle(void);
static StatusBits I2C1_GetStatusBits(void);

// @todo function prototypes from old I2C.h. Currently rewriting I2C.h. @remove these later
void I2C1_FsmInit(uint16_t tickRateInNs, uint16_t timeoutInUs);
void I2C1_FsmProcess(void);
void I2C1_FsmMasterWrite(I2CObject *self, uint8_t *writeData, uint8_t numBytes, bool repeatedStart);
void I2C1_FsmMasterRead(I2CObject *self, uint8_t *readData, uint8_t numBytes);
bool I2C1_FsmIsIdle(void);
//bool I2C1_FsmIsTransferFinished(void); // add check for any errors
void I2C1_FsmGetData(uint8_t *numBytesWritten, uint8_t *numBytesRead, I2CObject *context);

////////////////////////////////////////////////////////////////////////////////
//                                                                            //
// ***** Interface Functions *************************************************//
//                                                                            //
////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////
//                                                                            //
// ***** State Machine *******************************************************//
//                                                                            //
////////////////////////////////////////////////////////////////////////////////

static void I2C1_FsmIdle(Event *e)
{
    switch(e->sig)
    {
        case BEGIN_TRANSFER:
            if(e->private.repeatedStart)
            {
                // skip the start and go straight to the address
                e->private.repeatedStart = false;
                I2C1_TransmitByte(e->private.slaveAddress);
                I2C1_TimerStart();
                I2C1_Fsm.state = I2C1_FsmWriteAddress;
            }
            else
            {
                I2C1_Start(); // send I2C start command
                I2C1_TimerStart();
                I2C1_Fsm.state = I2C1_FsmStart;
            }
            break;
    }
}

static void I2C1_FsmStart(Event *e)
{
    switch(e->sig)
    {
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            // send slave address
            // The address stored in the event has already had been manipulated 
            // during the write setup, so that we don't need to do it here.
            I2C1_TransmitByte(e->private.slaveAddress);
            I2C1_TimerStart();
            I2C1_Fsm.state = I2C1_FsmWriteAddress;
            break;
    }
}

static void I2C1_FsmWriteAddress(Event *e)
{
    switch(e->sig)
    {
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            if(I2C1_GetAckStatus())
            {
                // address acknowledged.
                if(e->private.masterRead)
                {
                    // prepare to receive byte
                    I2C1_ReceiveEnable();
                    I2C1_Fsm.state = I2C1_FsmReadData;
                }
                else
                {
                    // load first data byte
                    I2C1_TransmitByte(ptrI2CSlave->writeBuffer[ptrI2CSlave->private.writeCount]);
                    I2C1_Fsm.state = I2C1_FsmWriteData;
                }
                I2C1_TimerStart();
            }
            break;
    }   
}

static void I2C1_FsmWriteData(Event *e)
{
    switch(e->sig)
    {
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            if(I2C1_GetAckStatus())
            {
                // data acknowledged. Check if there are more bytes to send
                ptrI2CSlave->private.writeCount++;
                if(ptrI2CSlave->private.writeCount < ptrI2CSlave->numBytesToSend)
                {
                    I2C1_TransmitByte(ptrI2CSlave->writeBuffer[ptrI2CSlave->private.writeCount]);
                    I2C1_TimerStart();
                    // stay in this state and continue sending bytes
                }
                else
                {
                    // We are finished sending bytes. Check to see if we should
                    // generate a repeated start
                    if(e->private.generateRepeatedStart)
                    {
                        I2C1_Restart(); // send repeated start command
                        I2C1_TimerStart();
                        I2C1_Fsm.state = I2C1_FsmRestart;
                    }
                    else
                    {
                        I2C1_Stop(); // send stop command
                        I2C1_TimerStart();
                        I2C1_Fsm.state = I2C1_FsmStop;
                    }
                }
            }
            break;
    }
}

static void I2C1_FsmStop(Event *e)
{
    switch(e->sig)
    {
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            // Stop is finished.
            I2C1_Fsm.state = I2C1_FsmIdle;
            break;
    }
}

static void I2C1_FsmRestart(Event *e)
{
    switch(e->sig)
    {
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            // restart is finished.
            e->private.generateRepeatedStart = false;
            e->private.repeatedStart = true;
            I2C1_Fsm.state = I2C1_FsmIdle;
            break;
    }
}

static void I2C1_FsmReadData(Event *e)
{
     switch(e->sig)
    {
        case DATA_RECEIVED:
            I2C1_TimerStop();
            ptrI2CSlave->readBuffer[ptrI2CSlave->private.readCount++] = I2C1_GetReceivedByte();
            if(ptrI2CSlave->private.readCount < ptrI2CSlave->numBytesToRead)
            {
                I2C1_SendAck(true);
            }
            else
            {
                I2C1_SendAck(false); // send NACK on last byte
            }
            I2C1_TimerStart();
            break;
        case BUS_IDLE_EVENT:
            I2C1_TimerStop();
            // prepare to receive byte
            if(ptrI2CSlave->private.readCount < ptrI2CSlave->numBytesToRead)
            {
                I2C1_ReceiveEnable();
                I2C1_TimerStart();
            }
            else
            {
                I2C1_Stop();
                I2C1_TimerStart();
                I2C1_Fsm.state = I2C1_FsmStop;
            }
            break;
    }
}

////////////////////////////////////////////////////////////////////////////////
//                                                                            //
// ***** State Machine Helper Functions **************************************//
//                                                                            //
////////////////////////////////////////////////////////////////////////////////

void I2C1_FsmInit(uint16_t tickRateInNs, uint16_t timeoutInUs)
{
    I2C1_Event.sig = 0;
    I2C1_Fsm.state = I2C1_FsmIdle;
    
    // TODO finish setting up timer using variables given
    I2C1_FsmTimer.period = (uint16_t)TIMEOUT_PERIOD_COUNT;
}

void I2C1_FsmProcess(void)
{
// ----- Check for Active Timers -----------------------------------------------
    
    if(I2C1_FsmTimer.flags.start)
    {
        I2C1_FsmTimer.flags.start = 0;
        I2C1_FsmTimer.count = TIMEOUT_PERIOD_COUNT;
        I2C1_FsmTimer.retryCount = RETRY_COUNT;
        I2C1_FsmTimer.flags.active = 1;
    }
    
// ----- Update Active Timers --------------------------------------------------
    
    if(I2C1_FsmTimer.flags.active)
    {
        I2C1_FsmTimer.count--;
        if(I2C1_FsmTimer.count == 0)
        {
            I2C1_FsmTimer.retryCount--;
            if(I2C1_FsmTimer.retryCount == 0)
            {
                I2C1_FsmTimer.flags.active = 0;
                I2C1_FsmTimer.flags.expired = 1;
                I2C1_FsmTimer.flags.retryFinished = 1;
            }
        }
    }
    
// ----- Check for I2C Events --------------------------------------------------
    
    StatusBits currentStatus;
    currentStatus = I2C1_GetStatusBits();
    
    if(I2C1_Fsm.statusBits.sendingStart && !currentStatus.sendingStart)
    {
        I2C1_Fsm.statusBits.sendingStart = 0;
        I2C1_Event.sig = BUS_IDLE_EVENT;
        I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
    }
    if(I2C1_Fsm.statusBits.sendingRestart && !currentStatus.sendingRestart)
    {
        I2C1_Fsm.statusBits.sendingRestart = 0;
        I2C1_Event.sig = BUS_IDLE_EVENT;
        I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
    }
    if(I2C1_Fsm.statusBits.sendingStop && !currentStatus.sendingStop)
    {
        I2C1_Fsm.statusBits.sendingStop = 0;
        I2C1_Event.sig = BUS_IDLE_EVENT;
        I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
    }
    if(I2C1_Fsm.statusBits.sendingAck && !currentStatus.sendingAck)
    {
        I2C1_Fsm.statusBits.sendingAck = 0;
        I2C1_Event.sig = BUS_IDLE_EVENT;
        I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
    }
    if(I2C1_Fsm.statusBits.transmitInProgress && !currentStatus.transmitInProgress)
    {
        // Be careful, with the PIC it will clear the transmit finished flag
        // before all 8 bits have been shifted out. So we must check for an 
        // empty transmit register as well before clearing our flag.
        if(!I2C1_IsTransmitRegisterFull())
        {
            I2C1_Fsm.statusBits.transmitInProgress = 0;
            I2C1_Event.sig = BUS_IDLE_EVENT;
            I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
        }
    }
    else if(I2C1_Fsm.statusBits.receiveInProgress && !currentStatus.receiveInProgress)
    {
        if(I2C1_IsReceivedDataAvailable())
        {
            I2C1_Fsm.statusBits.receiveInProgress = 0;
            I2C1_Event.sig = DATA_RECEIVED;
            I2C1_Fsm.state(&I2C1_Event);
        }
    }
    else if(I2C1_FsmTimer.flags.expired)
    {
        I2C1_FsmTimer.flags.expired = 0;
        I2C1_Event.sig = TIMEOUT;
        // TODO This is temporary! I removed during troubleshooting with 
        // logic analyzer. I don't think the timeout value is long enough.
        // So I need to do some measurements first
        //I2C1_Fsm.state(&I2C1_Event); 
    }
    else if(I2C1_FsmTimer.flags.retryFinished)
    {
        // We've sent the event to retry the command multiple times and it
        // has failed
        I2C1_FsmTimer.flags.retryFinished = 0;
        
        // TODO stop everything
    }
}

