mspinksosu/C-Libraries/I2C/I2C1_PIC32.c
void I2C1_FsmMasterWrite(I2CObject *self, uint8_t *writeData, uint8_t numBytes, bool repeatedStart)
{
    // TODO setup a lock to keep this function from being called if it's
    // already running. Decide if I want to make the return type a bool
    if(I2C1_Fsm.state != I2C1_FsmIdle)
        return;
    
    // TODO decide if I want to use a separate static I2C object or just use 
    // the I2C slave object
    ptrI2CSlave = self;
    ptrI2CSlave->writeBuffer = writeData;
    ptrI2CSlave->numBytesToSend = numBytes;
    ptrI2CSlave->private.writeCount = 0;
    
    // create an event to give to the state machine
    I2C1_Event.private.masterRead = false;
    I2C1_Event.private.slaveAddress = self->slaveAddress << 1; // clear R/W bit
    I2C1_Event.private.generateRepeatedStart = repeatedStart;
    I2C1_Event.sig = BEGIN_TRANSFER;
    I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
}

void I2C1_FsmMasterRead(I2CObject *self, uint8_t *readData, uint8_t numBytes)
{
    // TODO setup a lock to keep this function from being called if it's
    // already running. Decide if I want to make the return type a bool
    if(I2C1_Fsm.state != I2C1_FsmIdle)
        return;
    
    // TODO decide if I want to use a separate static I2C object or just use 
    // the I2C slave object
    ptrI2CSlave = self;
    ptrI2CSlave->readBuffer = readData;
    ptrI2CSlave->numBytesToRead = numBytes;
    ptrI2CSlave->private.readCount = 0;
    
    // create an event to give to the state machine
    I2C1_Event.private.masterRead = true;
    I2C1_Event.private.slaveAddress = ((self->slaveAddress << 1) | 1);
    I2C1_Event.sig = BEGIN_TRANSFER;
    I2C1_Fsm.state(&I2C1_Event); // call the current state and pass the event
}

bool I2C1_FsmIsIdle(void)
{
    if(I2C1_Fsm.state == I2C1_FsmIdle)
        return true;
    else
        return false;
}

void I2C1_FsmGetData(uint8_t *numBytesWritten, uint8_t *numBytesRead, I2CObject *context)
{
    // TODO decide if I want to use a separate static I2C object or just use 
    // the I2C slave object
    *numBytesWritten = ptrI2CSlave->private.writeCount;
    *numBytesRead = ptrI2CSlave->private.readCount;
    context = ptrI2CSlave;
}

static void I2C1_TimerStart(void)
{
    I2C1_FsmTimer.flags.start = 1;
}

static void I2C1_TimerStop(void)
{
    I2C1_FsmTimer.flags.active = 0;
}

static StatusBits I2C1_GetStatusBits(void)
{
    StatusBits retValue;
    retValue.sendingStart = I2C1CONbits.SEN;
    retValue.sendingRestart = I2C1CONbits.RSEN;
    retValue.sendingStop = I2C1CONbits.PEN;
    retValue.sendingAck = I2C1CONbits.ACKEN;
    retValue.receiveInProgress = I2C1CONbits.RCEN;
    retValue.transmitInProgress = I2C1STATbits.TRSTAT;
    return retValue;
}

////////////////////////////////////////////////////////////////////////////////
//                                                                            //
// ***** Peripheral Functions ************************************************//
//                                                                            //
////////////////////////////////////////////////////////////////////////////////

// @todo old init functions
// bool I2C1_InitWithFrequencies(float pbclkInMHz, uint16_t baudInKHz)
// {
//     // TODO check bounds
//     if(pbclkInMHz == 0)
//     {
//         return true;
//     }

//     /* Calculate baud rate. Use the ceiling function to round up in the 
//      * second step to get our register value. This will make the actual 
//      * baud rate slightly slower than the exact value. It is better to be 
//      * slightly slower, rather than faster, than the computed bus speed. 
//      * Equation 24-1. Datasheet section 24, page 19 */
//     uint32_t brgValue = 1000000 / (2 * baudInKHz) - 104;
//     brgValue = (uint32_t)(ceil(brgValue / 1000.0 * pbclkInMHz - 2));
//     bool temp = I2C1_InitWithBRGValue(brgValue);
    
//     return temp;
// }

// bool I2C1_InitWithBRGValue(uint32_t brgValue)
// {
//     // If you call this function directly I must assume you know what you are 
//     // doing and that you've already calculated the correct BRG value
//     if(brgValue == 0x00 || brgValue == 0x01)
//     {
//         // You've chosen an incompatible number for the baud rate generator
//         I2C1BRG = DEFAULT_BRG_VALUE;
//         return true;
//     }
    
//     I2C1_Fsm.state = I2C1_FsmIdle;
//     I2C1_Event.sig = 0;
//     I2C1_FsmTimer.period = (uint16_t)TIMEOUT_PERIOD_COUNT;
//     I2C1_FsmTimer.retryCount = RETRY_COUNT;
    
//     I2C1BRG = (uint16_t)brgValue;
//     I2C1CONbits.ON = 1; // enable I2C module
//     return false;
// }

bool I2C1_IsBusy(void)
{
    /* I2CxCON bits:
     0, SEN:   0 = start condition idle
     1, RSEN:  0 = restart condition idle
     2, PEN:   0 = stop condition idle
     3, RCEN:  0 = receive sequence not in progress
     4, ACKEN: 0 = acknowledge sequence idle
     
     TRSTAT: 0 = master transmit not in progress
     */
    if((I2CxCON & 0x0000001F) || I2C1STATbits.TRSTAT)
        return true;
    else
        return false;
}

void I2C1_Start(void)
{
    I2CxCONbits.SEN = 1; // cleared by module when finished
}

void I2C1_Stop(void)
{
    I2CxCONbits.PEN = 1; // cleared by module when finished
}

void I2C1_Restart(void)
{
    I2CxCONbits.RSEN = 1; // cleared by module when finished
}

void I2C1_SendAck(bool ackOrNack)
{
    if(ackOrNack)
        I2CxCONbits.ACKDT = 0; // send ack
    else
        I2CxCONbits.ACKDT = 1; // send nack
    
    I2CxCONbits.ACKEN = 1; // cleared by module when finished
}

bool I2C1_GetAckStatus(void)
{
    if(I2C1STATbits.ACKSTAT == 1)
        return false; // acknowledge not received
    else
        return true;
}

void I2C1_ReceiveEnable(void)
{
    /* RCEN bit is automatically cleared at the end of the 8th bit of a 
    received data byte */
    I2CxCONbits.RCEN = 1;
}

void I2C1_ReceiveDisable(void)
{

}

bool I2C1_IsReceivedDataAvailable(void)
{
    if(I2CxSTATbits.RBF == 1) // 1: receive complete
        return true; 
    else
        return false;
}

uint8_t I2C1_GetReceivedByte(void)
{
    return I2CxRCV;
}

void I2C1_TransmitEnable(void)
{

}

void I2C1_TransmitDisable(void)
{

}

void I2C1_TransmitByte(uint8_t dataToSend)
{
    I2CxTRN = dataToSend;
}

bool I2C1_IsTransmitRegisterFull(void)
{
    if(I2CxSTATbits.TBF == 1)
        return true;
    else
        return false;
}

// *****************************************************************************

/*
 End of File
 */
